# -*- coding: utf-8 -*-

# 1. NoneType - ничего , пустота -> none
# 2. Boolean - истина или ложь -> True/False
# 3. String = строки - str -> "Hello world", 'Hello world'
# "My name is Jihn Snow!"
# "I'm North King"
# 'I\'m North King'
# 4. Числовые типы данных
# a) integer -целое число int -> -1, 2, 555
# b) float - число с плавающей точкой -> 1.5, 15.25 
# c) complex - oj: 1, 5-9j
# 5. Списковые типы данных (коллекция)
# a) list(массив/список) -> [5, 2, 4, True, 'hello']
# b) tuple (кортеж) -> (1, 2, 3, None)
# c) range (последовательеость) -> range (1, 10)
# 6. set () - множество -> {1,2,3,4,5,6,7,8,9}
# 7. dict (словари) -> содержат в себе данные в виде ключа и значения {1: 'one', 2: 'two'}
# ---------------------------------------
# Mutable (изменяемые тилы данных)
# 1. list
# 2. set 
# 3. dict


# Immutable (неизменяемые типы данных)
# 1.None
# 2. bool 
# 3. int, float, complex 
# 4. str 
# 5. tuple, range 
# 6. frozenset 
# ------------------------

# Переменная - проименнованная область памяти, предназеаченная для хранения даннных.  
# С ее помощью мы можкем проводить различные операции  с данными

# num = 5
# str1 = "Hello world!"
''' 
Стандартый вывод данных
'''
# в питоне для вывода данных в термиеал используется встроенная функция print ()
# stroka = "Hello world! My name is John"
# print (stroka) 

# """
# стандартный ввод данных через термиеал исп функция input()
# """
# a = input ("введите число:")
# num = int(a)
# print(num)
# print (type(num))
# print ('данные в переменных', a, num)
# print ("в переменной а хранится:", a, 'ее тип данных', type(a))
# print ('В переменной num хранится:', num, 'ее тип данных', type (num))
