# GIT - это распределенная система контроля версий (СКВ)
# СКВ - это система для отслеживания и введения истории изменения файлов в вашем проекте.
# При помощи распределенности GITa еще и организовывается командная работа.

# Репозиторий - хранилище вашего кода и истории его изменений

# GitHub - веб-сайт для размещения git-репозиториев в совместной разработке проектов

# Команды git:
# 1.  git init - она создает новый локальный репо(репозиторий), в той директории в которой
# была прописана команда.(Команда вводится один раз в начале)

# 2. git add - команда для добавления изменений в систему отслеживаний гита

# 3. git commit -m '<comment>' - команда для сохранения всех изменений в локальном репозитории 
# с коментарием к ним

# 4. git remote add <origin> <url> - команда для того, чтобы связать ваш репо в гитхабе

# 5. git push <origin> <main> - команда для отправки всех ваших изменений на удаленный репо

# 6. git status - команда для проверки статуса изменились ли?????


# _____________________
# 1) git init
#     2) git add
#     3) git commit -m ''
# 4) git remote add origin <url>
#     5)git push origin main














